#         Цикл For
#     # Задача 1.1 без цикла for
# num = [1,2,3,4,5,6,7,8,]
# print(num)

#     Задача 1.2 цикл for
# num = [1,2,3,4,5,6,7,8,]
# for i in num:
#     print(i)


#     Задача 1.3 цикл for
# num = [1,2,3,4,5,6,7,8,]
# for i in num:
#     if i% 2 ==0:
#         print(i, "Четная")
#     else:
#         print(i, "Нечетная")


#     Задача 2 функция range и цикл for

# for nur in range(1,1001):
#     print(nur)


#     Задача 2.1 функция range и цикл for

# lst = []

# for nur in range(1, 1000, ):
#     lst.append(nur)
# print(lst)

            # Цикл While
    #Задача  3.1 ЦИКЛ while
# x = 20 
# y = 30
# while x < y:
#     x += 1
#     print(x)
        
    #Задача  3.1 ЦИКЛ while
# n = 0
# while True:
#     n += 1
#     print(n)


     #Задача  3.2 ЦИКЛ while
# num = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
# for i in num:
#     print(i)
#     if i ==16:
#         break       #break - Продолжает если находит элемент список 
##      contiune    #contiune - Продолжает список

        #Задача  3.3 ЦИКЛ while   

# apps = ["Google", "Telegram", "Whatsapp", "Instagram"]
# find_app = input("Напишите приложение, которую  вы ищите: ")  
# for i in apps:
#     if i ==find_app:
#         print("Ваше приложение найдено!;}")
#         print(i)
#         break
#     else:
#         print("Ваше приложение не найдено!:{")


        #Задача  3.4 ЦИКЛ while   

# import random
# random1 = random.randint(1,10001)
# print("Рандомный пароль", random1)
# n = 0
# while True:
#     n +=1
#     print(n, random1)
#     if n == random1:
#         print("Пароль найден", n)
#         break


        #Решение Задач 1

# for nur in range(1,6):
#     print(nur)


        #Решение Задач 2
# lst = []
# for i in range(1, 101):
#     lst.append(i)
#     print(lst)


        #Решение Задач 3
# for i in range(0, 497, 2):
#     print(i)

        #Решение Задач 4
# lst = []
# for i in range(1, 1000000):
#     lst.append(i)
# print(lst)
# print(min(lst))
# print(max(lst))
# print(sum(lst))


        #Решение Задач 4
# lst = []
# for i in range(0, 101):
#     lst.append(0)
# print(lst)
        
        
        #Решение Задач 6
# a =input("Ввежите первое  значения: ")
# b = input('Введите второе значение: ')
# a,b = b,a
# print(a)
# print(b)

        #Решение Задач 7
# n = 0мный пароль", random1)
n = 0
while True:
    n +=1
    print(n, random1)
    if n == random1:
        print("Пароль найден", n)
        break
# age = input("Введите ваш возраст:")
# while True:
#   

#     if age >18:
#         print("Доступ разрешен")
#         break
#     else:
#         print("Извините, пользование данным ресурсом только с 18 лет")
#         continue
   


















