
    #Функция - def <имя для функции>():
                        #<имя для функции>
    #Пример 1.1
def nurbolot():
    print("Hello class")

# nurbolot()          #Функция не будет работать если его не вызвать. Если мы не напишем <nurbolot> 

    #Пример 1.2

def add():
    a=int(input("Введит епервое число: "))
    b=int(input("Введите второе ччисло: "))
    print(a+b)

# add()            #Функция не будет работать если его не вызвать. Если мы не напишем <add>

    #Пример 1.3

def chet():
    a=int(input("Введите число: "))
    if a%2==0:
        print("Четное")
    else:
        print("Не четное")

# chet()              #Функция не будет работать если его не вызвать. Если мы не напишем <chet>


    #Пример 1.4
def parametr(name):     #Параметр
    print(name)

parametr("Nurbolot")       #Аргумент





























































































































